In [4]:
import pandas as pd

In [5]:
data = {
    "Nome": ["Teo", "Nah", "Maria", "Nah", "Lara", "Teo"],
    "Idade": [32, 33, 2, 33, 31, 32],
    "updated_at": [1, 2, 3, 1, 2, 3],
}

In [6]:
df = pd.DataFrame(data)
df = df.sort_values(by="updated_at", ascending=False)
df

    Nome  Idade  updated_at
2  Maria      2           3
5    Teo     32           3
1    Nah     33           2
4   Lara     31           2
0    Teo     32           1
3    Nah     33           1

In [7]:
df = df.drop_duplicates(subset=["Nome","Idade"], keep="first")
df

    Nome  Idade  updated_at
2  Maria      2           3
5    Teo     32           3
1    Nah     33           2
4   Lara     31           2